04/slides.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Intermediate topics and CLI</title>
<meta name="author" content="(Christoph Paulik)"/>

<link rel="stylesheet" href="../reveal.js/css/reveal.css"/>
<link rel="stylesheet" href="../reveal.js/css/theme/black.css" id="theme"/>
<link rel="stylesheet" href="../code_formatting.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="" data-background-size="" data-background-repeat="">
<h1>Intermediate topics and CLI</h1> <h2>Christoph Paulik</h2> <h2><a href="mailto:"></a></h2> <h2></h2>
</section>

<section>
<section id="sec-1">

<h2>List and Dict comprehension</h2>
<ul class="org-ul">
<li>for creation of lists or dictionaries based on some loop
</li>
<li>shorter than a classic for loop
</li>
</ul>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #0084C8; font-weight: bold;">dataset1</span> = <span style="color: #707183;">[</span>1.73, 80, 2.4122, -4<span style="color: #707183;">]</span>
<span style="color: #0084C8; font-weight: bold;">threshold</span> = 2.
<span style="color: #0084C8; font-weight: bold;">result</span> = <span style="color: #707183;">[</span>x &gt; threshold <span style="color: #A52A2A; font-weight: bold;">for</span> x <span style="color: #A52A2A; font-weight: bold;">in</span> dataset1<span style="color: #707183;">]</span>
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>result<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; [False, True, True, False]
</pre>

</section>
<section id="sec-1-1">

<h3>Dictionaries</h3>
<ul class="org-ul">
<li>we can also construct a dictionary 
</li>
</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #0084C8; font-weight: bold;">cl</span> = <span style="color: #707183;">{</span><span style="color: #F5666D;">True</span>: <span style="color: #4E9A06;">'larger'</span>, <span style="color: #F5666D;">False</span>: <span style="color: #4E9A06;">'smaller'</span><span style="color: #707183;">}</span>
<span style="color: #0084C8; font-weight: bold;">result</span> = <span style="color: #707183;">{</span>k: cl<span style="color: #7388d6;">[</span>k&gt;threshold<span style="color: #7388d6;">]</span> <span style="color: #A52A2A; font-weight: bold;">for</span> k <span style="color: #A52A2A; font-weight: bold;">in</span> dataset1<span style="color: #707183;">}</span>
<span style="color: #A52A2A; font-weight: bold;">print</span> result
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; {80: 'larger', 1.73: 'smaller', -4: 'smaller', 2.4122: 'larger'}
</pre>

</section>
<section id="sec-1-2">

<h3>Multiple arguments</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #0084C8; font-weight: bold;">data</span> = <span style="color: #707183;">[</span><span style="color: #4E9A06;">'a'</span>, <span style="color: #4E9A06;">'b'</span>, <span style="color: #4E9A06;">'c'</span>, <span style="color: #4E9A06;">'d'</span><span style="color: #707183;">]</span>
<span style="color: #0084C8; font-weight: bold;">result</span> = <span style="color: #707183;">{</span>i: x <span style="color: #A52A2A; font-weight: bold;">for</span> i,x <span style="color: #A52A2A; font-weight: bold;">in</span> <span style="color: #A020F0;">enumerate</span><span style="color: #7388d6;">(</span>data<span style="color: #7388d6;">)</span><span style="color: #707183;">}</span>
<span style="color: #A52A2A; font-weight: bold;">print</span> result
</pre>
</div>

<pre class="example">
{0: 'a', 1: 'b', 2: 'c', 3: 'd'}
</pre>

</section>
<section id="sec-1-3">

<h3><del>Mini</del> Tiny Exercise</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #204A87;">########################################################</span>
<span style="color: #204A87;"># </span><span style="color: #204A87;">Tiny Exercise</span>

<span style="color: #204A87;"># </span><span style="color: #204A87;">Create a list that contains the square value of every</span>
<span style="color: #204A87;"># </span><span style="color: #204A87;">element in dataset1 using list comprehension.</span>
<span style="color: #204A87;">########################################################</span>
</pre>
</div>
</section>

</section>
<section>
<section id="sec-2">

<h2>Advanced function arguments</h2>
<p>
Arguments to functions given as lists or tuples can be unpacked by python
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">multi</span><span style="color: #707183;">(</span>a, b<span style="color: #707183;">)</span>:
    <span style="color: #4E9A06;">"""Documentation does not fit on slide"""</span>
    <span style="color: #A52A2A; font-weight: bold;">return</span> a * b

<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>multi<span style="color: #7388d6;">(</span>2,3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #0084C8; font-weight: bold;">numbers</span> = <span style="color: #707183;">[</span>3, 4<span style="color: #707183;">]</span>
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>multi<span style="color: #7388d6;">(</span>*numbers<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
... ... &gt;&gt;&gt; 6
&gt;&gt;&gt; 12
</pre>

</section>
<section id="sec-2-1">

<h3></h3>
<p>
The <code>*</code> tells python to unpack the arguments
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">print</span> multi<span style="color: #707183;">(</span>numbers<span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: multi() takes exactly 2 arguments (1 given)
</pre>

</section>
<section id="sec-2-2">

<h3>Keywords</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">multikw</span><span style="color: #707183;">(</span>arg1=<span style="color: #4E9A06;">"dummy"</span>, arg2=<span style="color: #4E9A06;">"text"</span><span style="color: #707183;">)</span>:
    <span style="color: #4E9A06;">"""Documentation does not fit on slide"""</span>
    <span style="color: #A52A2A; font-weight: bold;">return</span> <span style="color: #4E9A06;">" "</span>.join<span style="color: #707183;">(</span><span style="color: #7388d6;">[</span>arg1, arg2<span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>

<span style="color: #0084C8; font-weight: bold;">kwargs</span> = <span style="color: #707183;">{</span><span style="color: #4E9A06;">'arg1'</span>: <span style="color: #4E9A06;">"this text comes from"</span>,
          <span style="color: #4E9A06;">'arg2'</span>: <span style="color: #4E9A06;">"a keyword dictionary"</span><span style="color: #707183;">}</span>

<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>multikw<span style="color: #7388d6;">()</span><span style="color: #707183;">)</span>
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>multikw<span style="color: #7388d6;">(</span>**kwargs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
dummy text
this text comes from a keyword dictionary
</pre>

</section>
<section id="sec-2-3">

<h3>* and ** in function definitions</h3>
<p>
<code>*</code> will be a tuple <code>**</code> a dictionary
</p>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">multi</span><span style="color: #707183;">(</span>*args<span style="color: #707183;">)</span>:
    <span style="color: #4E9A06;">"""</span>
<span style="color: #4E9A06;">    Multiplies all given numbers</span>
<span style="color: #4E9A06;">    """</span>
    <span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span><span style="color: #A020F0;">type</span><span style="color: #7388d6;">(</span>args<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
    <span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span><span style="color: #4E9A06;">"{} Arguments to multiply"</span>.<span style="color: #A020F0;">format</span><span style="color: #7388d6;">(</span><span style="color: #A020F0;">len</span><span style="color: #909183;">(</span>args<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
    <span style="color: #0084C8; font-weight: bold;">res</span> = 1
    <span style="color: #A52A2A; font-weight: bold;">for</span> arg <span style="color: #A52A2A; font-weight: bold;">in</span> args:
        <span style="color: #0084C8; font-weight: bold;">res</span> *= arg
    <span style="color: #A52A2A; font-weight: bold;">return</span> res
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>multi<span style="color: #7388d6;">(</span>2,3,4,5,6<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
&lt;type 'tuple'&gt;
5 Arguments to multiply
720
</pre>
</section>
<section id="sec-2-4">

<h3>**</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">print_kw</span><span style="color: #707183;">(</span>**kwargs<span style="color: #707183;">)</span>:
    <span style="color: #4E9A06;">"""print keywords"""</span>

    <span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span><span style="color: #A020F0;">type</span><span style="color: #7388d6;">(</span>kwargs<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
    <span style="color: #A52A2A; font-weight: bold;">for</span> key <span style="color: #A52A2A; font-weight: bold;">in</span> kwargs:
        <span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span><span style="color: #4E9A06;">"{}: {}"</span>.<span style="color: #A020F0;">format</span><span style="color: #7388d6;">(</span>key, kwargs<span style="color: #909183;">[</span>key<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

print_kw<span style="color: #707183;">(</span>argument1=45, argument2=<span style="color: #4E9A06;">"string"</span>, test=<span style="color: #4E9A06;">"hello"</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
&lt;type 'dict'&gt;
test: hello
argument2: string
argument1: 45
</pre>

</section>
<section id="sec-2-5">

<h3>Functions everywhere</h3>
<ul class="org-ul">
<li>Every object can be passed into a function
</li>
<li>e.g. another function
</li>
</ul>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">do</span><span style="color: #707183;">(</span>f, a, b<span style="color: #707183;">)</span>:
   <span style="color: #A52A2A; font-weight: bold;">print</span> f.<span style="color: #A020F0;">__doc__</span>
   <span style="color: #A52A2A; font-weight: bold;">return</span> f<span style="color: #707183;">(</span>a,b<span style="color: #707183;">)</span> 
<span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">add</span><span style="color: #707183;">(</span>a, b<span style="color: #707183;">)</span>:
   <span style="color: #4E9A06;">"""addition"""</span>
   <span style="color: #A52A2A; font-weight: bold;">return</span> a+b
<span style="color: #A52A2A; font-weight: bold;">def</span> <span style="color: #00578E; font-weight: bold;">sub</span><span style="color: #707183;">(</span>a, b<span style="color: #707183;">)</span>:
   <span style="color: #4E9A06;">"""subtraction"""</span>
   <span style="color: #A52A2A; font-weight: bold;">return</span> a-b

<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>do<span style="color: #7388d6;">(</span>add, 2, 3<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #A52A2A; font-weight: bold;">print</span><span style="color: #707183;">(</span>do<span style="color: #7388d6;">(</span>sub, 3, 2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<pre class="example">
addition
5
subtraction
1
</pre>
</section>

</section>
<section>
<section id="sec-3">

<h2>Control Structures</h2>
<p>
pass
assert
break, continue
for&#x2013;else
finally
</p>
</section>
</section>
<section>
<section id="sec-4">

<h2>Command Line Interface (CLI)</h2>
</section>
<section id="sec-4-1">

<h3>Arguments to your scripts</h3>

</section>
<section id="sec-4-2">

<h3>Getting user input</h3>
</section>
</section>
</div>
</div>

<script src="../reveal.js/lib/js/head.min.js"></script>
<script src="../reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [

]
});
</script>
</body>
</html>
